; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p3---int100n150-m25---int100c200---s28---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level8 level8)
(sum level0 level18 level18)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level8 level9)
(sum level1 level18 level19)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level8 level10)
(sum level2 level18 level20)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level8 level11)
(sum level3 level18 level21)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level8 level12)
(sum level4 level18 level22)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level8 level13)
(sum level5 level18 level23)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level8 level14)
(sum level6 level18 level24)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level8 level15)
(sum level7 level18 level25)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level8 level16)
(sum level8 level18 level26)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level8 level17)
(sum level9 level18 level27)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level8 level18)
(sum level10 level18 level28)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level8 level19)
(sum level11 level18 level29)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level8 level20)
(sum level12 level18 level30)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level8 level21)
(sum level13 level18 level31)
(sum level13 level25 level38)
(sum level14 level1 level15)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level8 level22)
(sum level14 level18 level32)
(sum level14 level25 level39)
(sum level15 level1 level16)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level8 level23)
(sum level15 level18 level33)
(sum level15 level25 level40)
(sum level16 level1 level17)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level8 level24)
(sum level16 level18 level34)
(sum level16 level25 level41)
(sum level17 level1 level18)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level8 level25)
(sum level17 level18 level35)
(sum level17 level25 level42)
(sum level18 level1 level19)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level8 level26)
(sum level18 level18 level36)
(sum level18 level25 level43)
(sum level19 level1 level20)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level8 level27)
(sum level19 level18 level37)
(sum level19 level25 level44)
(sum level20 level1 level21)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level8 level28)
(sum level20 level18 level38)
(sum level20 level25 level45)
(sum level21 level1 level22)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level8 level29)
(sum level21 level18 level39)
(sum level21 level25 level46)
(sum level22 level1 level23)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level8 level30)
(sum level22 level18 level40)
(sum level22 level25 level47)
(sum level23 level1 level24)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level8 level31)
(sum level23 level18 level41)
(sum level23 level25 level48)
(sum level24 level1 level25)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level8 level32)
(sum level24 level18 level42)
(sum level24 level25 level49)
(sum level25 level1 level26)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level8 level33)
(sum level25 level18 level43)
(sum level25 level25 level50)
(sum level26 level1 level27)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level8 level34)
(sum level26 level18 level44)
(sum level26 level25 level51)
(sum level27 level1 level28)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level8 level35)
(sum level27 level18 level45)
(sum level27 level25 level52)
(sum level28 level1 level29)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level8 level36)
(sum level28 level18 level46)
(sum level28 level25 level53)
(sum level29 level1 level30)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level8 level37)
(sum level29 level18 level47)
(sum level29 level25 level54)
(sum level30 level1 level31)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level8 level38)
(sum level30 level18 level48)
(sum level30 level25 level55)
(sum level31 level1 level32)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level8 level39)
(sum level31 level18 level49)
(sum level31 level25 level56)
(sum level32 level1 level33)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level8 level40)
(sum level32 level18 level50)
(sum level32 level25 level57)
(sum level33 level1 level34)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level8 level41)
(sum level33 level18 level51)
(sum level33 level25 level58)
(sum level34 level1 level35)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level8 level42)
(sum level34 level18 level52)
(sum level35 level1 level36)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level8 level43)
(sum level35 level18 level53)
(sum level36 level1 level37)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level8 level44)
(sum level36 level18 level54)
(sum level37 level1 level38)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level8 level45)
(sum level37 level18 level55)
(sum level38 level1 level39)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level8 level46)
(sum level38 level18 level56)
(sum level39 level1 level40)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level8 level47)
(sum level39 level18 level57)
(sum level40 level1 level41)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level8 level48)
(sum level40 level18 level58)
(sum level41 level1 level42)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level8 level49)
(sum level42 level1 level43)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level8 level50)
(sum level43 level1 level44)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level8 level51)
(sum level44 level1 level45)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level8 level52)
(sum level45 level1 level46)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level8 level53)
(sum level46 level1 level47)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level46 level8 level54)
(sum level47 level1 level48)
(sum level47 level4 level51)
(sum level47 level5 level52)
(sum level47 level8 level55)
(sum level48 level1 level49)
(sum level48 level4 level52)
(sum level48 level5 level53)
(sum level48 level8 level56)
(sum level49 level1 level50)
(sum level49 level4 level53)
(sum level49 level5 level54)
(sum level49 level8 level57)
(sum level50 level1 level51)
(sum level50 level4 level54)
(sum level50 level5 level55)
(sum level50 level8 level58)
(sum level51 level1 level52)
(sum level51 level4 level55)
(sum level51 level5 level56)
(sum level52 level1 level53)
(sum level52 level4 level56)
(sum level52 level5 level57)
(sum level53 level1 level54)
(sum level53 level4 level57)
(sum level53 level5 level58)
(sum level54 level1 level55)
(sum level54 level4 level58)
(sum level55 level1 level56)
(sum level56 level1 level57)
(sum level57 level1 level58)

(connected l0 l2)
(fuelcost level1 l0 l2)
(connected l0 l4)
(fuelcost level25 l0 l4)
(connected l1 l2)
(fuelcost level8 l1 l2)
(connected l1 l3)
(fuelcost level18 l1 l3)
(connected l2 l0)
(fuelcost level1 l2 l0)
(connected l2 l1)
(fuelcost level8 l2 l1)
(connected l2 l3)
(fuelcost level25 l2 l3)
(connected l2 l4)
(fuelcost level5 l2 l4)
(connected l3 l1)
(fuelcost level18 l3 l1)
(connected l3 l2)
(fuelcost level25 l3 l2)
(connected l3 l4)
(fuelcost level4 l3 l4)
(connected l4 l0)
(fuelcost level25 l4 l0)
(connected l4 l2)
(fuelcost level5 l4 l2)
(connected l4 l3)
(fuelcost level4 l4 l3)

(at t0 l0)
(fuel t0 level58)
(= (total-cost) 0)

(at p0 l0)
(at p1 l3)
(at p2 l2)
)

(:goal
(and
(at p0 l4)
(at p1 l0)
(at p2 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 3
2. (drive t0 l0 l2 level57 level1 level58)
   deleted: (at t0 l0) (fuel t0 level58)
   added: (at t0 l2) (fuel t0 level57)
   goals met: 0 of 3
3. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 0 of 3
4. (drive t0 l2 l1 level49 level8 level57)
   deleted: (at t0 l2) (fuel t0 level57)
   added: (at t0 l1) (fuel t0 level49)
   goals met: 0 of 3
5. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 1 of 3
6. (drive t0 l1 l3 level31 level18 level49)
   deleted: (at t0 l1) (fuel t0 level49)
   added: (at t0 l3) (fuel t0 level31)
   goals met: 1 of 3
7. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 1 of 3
8. (drive t0 l3 l4 level27 level4 level31)
   deleted: (at t0 l3) (fuel t0 level31)
   added: (at t0 l4) (fuel t0 level27)
   goals met: 1 of 3
9. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 2 of 3
10. (drive t0 l4 l0 level2 level25 level27)
   deleted: (at t0 l4) (fuel t0 level27)
   added: (at t0 l0) (fuel t0 level2)
   goals met: 2 of 3
11. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 3 of 3
